In [1]:
import numpy as np
import pandas as pd

my_data = [ 10 , 20 , 30 , 40 , 50 , 60 , 70 , 80 , 90 , 100 , 110 , 120 ]
my_labels = [ "JAN" , "FEB" , "MAR" , "APR" , "MAY" , "JUN" , "JUL" , "AUG" , "SEP" , "OCT" , "NOV" , "DEC" ]

pd.Series ( data=my_data )

0      10
1      20
2      30
3      40
4      50
5      60
6      70
7      80
8      90
9     100
10    110
11    120
dtype: int64

In [2]:
pd.Series ( data=my_data , index=my_labels )

JAN     10
FEB     20
MAR     30
APR     40
MAY     50
JUN     60
JUL     70
AUG     80
SEP     90
OCT    100
NOV    110
DEC    120
dtype: int64

In [3]:
pd.Series ( my_data , my_labels )

JAN     10
FEB     20
MAR     30
APR     40
MAY     50
JUN     60
JUL     70
AUG     80
SEP     90
OCT    100
NOV    110
DEC    120
dtype: int64

In [4]:
pd.Series ( my_labels , my_data )

10     JAN
20     FEB
30     MAR
40     APR
50     MAY
60     JUN
70     JUL
80     AUG
90     SEP
100    OCT
110    NOV
120    DEC
dtype: object

In [5]:
arr = np.array(my_data)
arr

array([ 10,  20,  30,  40,  50,  60,  70,  80,  90, 100, 110, 120])

In [6]:
pd.Series (arr)

0      10
1      20
2      30
3      40
4      50
5      60
6      70
7      80
8      90
9     100
10    110
11    120
dtype: int32

In [7]:
pd.Series ( arr , my_labels )

JAN     10
FEB     20
MAR     30
APR     40
MAY     50
JUN     60
JUL     70
AUG     80
SEP     90
OCT    100
NOV    110
DEC    120
dtype: int32

In [8]:
pd.Series ( data = [ sum , max , min , len , type , list , range , print , float , str ] )

0      <built-in function sum>
1      <built-in function max>
2      <built-in function min>
3      <built-in function len>
4               <class 'type'>
5               <class 'list'>
6              <class 'range'>
7    <built-in function print>
8              <class 'float'>
9                <class 'str'>
dtype: object

In [9]:
ser01 = pd.Series ( [3,4,9,10,11,12] , [ "MAR" , "APR" , "SEP" , "OCT" , "NOV" , "DEC" ] )
ser01

MAR     3
APR     4
SEP     9
OCT    10
NOV    11
DEC    12
dtype: int64

In [10]:
ser02 = pd.Series ( [3,4,5,6,7,8] , [ "MAR" , "APR" , "MAY" , "JUN" , "JUL" , "AUG" ] )
ser02

MAR    3
APR    4
MAY    5
JUN    6
JUL    7
AUG    8
dtype: int64

In [11]:
ser03 = ser01 + ser02
ser03

APR    8.0
AUG    NaN
DEC    NaN
JUL    NaN
JUN    NaN
MAR    6.0
MAY    NaN
NOV    NaN
OCT    NaN
SEP    NaN
dtype: float64

In [12]:
np.random.seed(101)
df = pd.DataFrame ( np.random.randn(5,4) , ["A","B","C","D","E"] , ["W","X","Y","Z"] )
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [15]:
type ( df["W"] )

pandas.core.series.Series

In [16]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [17]:
df [["W","Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [18]:
df["NEW"] = df["X"] + df["Y"]
df["NEW"]

A    1.536102
B   -1.167395
C    1.268936
D   -1.692109
E    4.584725
Name: NEW, dtype: float64

In [19]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [20]:
df.drop ( "NEW" , axis=1 )
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [21]:
df.drop ( "NEW" , axis=1 , inplace=True )
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df.drop ( "E" )

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [23]:
df.shape

(5, 4)

In [24]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df.loc["E"]

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

In [26]:
df.iloc[4]

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

In [27]:
df.loc ["B","Y"]

-0.8480769834036315

In [28]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df.loc [ ["A","B"] , ["W","Y"] ]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [30]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [31]:
df < 0

       W      X      Y      Z
A  False  False  False  False
B  False   True   True  False
C   True  False  False   True
D  False   True   True  False
E  False  False  False  False

In [32]:
df [ df > 0 ]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df [ df < 0 ]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B       NaN -0.319318 -0.848077       NaN
C -2.018168       NaN       NaN -0.589001
D       NaN -0.758872 -0.933237       NaN
E       NaN       NaN       NaN       NaN

In [34]:
df["X"] > 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [35]:
df["X"] < 0

A    False
B     True
C    False
D     True
E    False
Name: X, dtype: bool

In [36]:
df [ df["X"] > 0 ]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df [ df["X"] < 0 ]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [38]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df [ ( df["Y"] > 0 ) & ( df["Z"] > 0 ) ]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df [ ( df["Y"] > 0 ) | ( df["Z"] > 0 ) ]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [42]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
new_index = "MON TUE WED THU FRI" .split()
new_index

['MON', 'TUE', 'WED', 'THU', 'FRI']

In [44]:
df["DAYS"] = new_index
df

          W         X         Y         Z DAYS
A  2.706850  0.628133  0.907969  0.503826  MON
B  0.651118 -0.319318 -0.848077  0.605965  TUE
C -2.018168  0.740122  0.528813 -0.589001  WED
D  0.188695 -0.758872 -0.933237  0.955057  THU
E  0.190794  1.978757  2.605967  0.683509  FRI

In [45]:
df.set_index ("DAYS")

             W         X         Y         Z
DAYS
MON   2.706850  0.628133  0.907969  0.503826
TUE   0.651118 -0.319318 -0.848077  0.605965
WED  -2.018168  0.740122  0.528813 -0.589001
THU   0.188695 -0.758872 -0.933237  0.955057
FRI   0.190794  1.978757  2.605967  0.683509

In [46]:
df

          W         X         Y         Z DAYS
A  2.706850  0.628133  0.907969  0.503826  MON
B  0.651118 -0.319318 -0.848077  0.605965  TUE
C -2.018168  0.740122  0.528813 -0.589001  WED
D  0.188695 -0.758872 -0.933237  0.955057  THU
E  0.190794  1.978757  2.605967  0.683509  FRI

In [47]:
outside = [ "G1" , "G1" , "G1" , "G2" , "G2" , "G2" ]
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [48]:
inside = [1,2,3,1,2,3]
inside

[1, 2, 3, 1, 2, 3]

In [49]:
hier_index = list ( zip ( outside , inside ) )
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [50]:
hier_index = pd.MultiIndex.from_tuples ( hier_index )
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [51]:
newdf = pd.DataFrame ( np.random.randn(6,2) , hier_index , ["A","B"] )
newdf

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [52]:
newdf.loc["G1"]

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [53]:
newdf.loc["G1"].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [54]:
newdf.index.names

FrozenList([None, None])

In [55]:
newdf.index.names = [ "GROUPS" , "NUM" ]
newdf

                   A         B
GROUPS NUM
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [56]:
newdf.loc["G2"]

            A         B
NUM
1    0.166905  0.184502
2    0.807706  0.072960
3    0.638787  0.329646

In [57]:
newdf.loc["G2"].loc[2]

A    0.807706
B    0.072960
Name: 2, dtype: float64

In [58]:
newdf.loc["G2"].loc[2]["B"]

0.07295967531703869

In [59]:
newdf.xs

<bound method NDFrame.xs of                    A         B
GROUPS NUM
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646>

In [60]:
newdf.xs("G1")

            A         B
NUM
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [61]:
newdf.xs ( 1 , level="NUM" )

               A         B
GROUPS
G1      0.302665  1.693723
G2      0.166905  0.184502

In [62]:
dicts = { "A" : [24,31,27,np.nan] , "B" : [28,32,25,31] , "C" : [30,23,np.nan,26] , "D" : [29,np.nan,22,np.nan] }
dfs = pd.DataFrame ( data=dicts )
dfs

      A   B     C     D
0  24.0  28  30.0  29.0
1  31.0  32  23.0   NaN
2  27.0  25   NaN  22.0
3   NaN  31  26.0   NaN

In [63]:
dfs.dropna()

      A   B     C     D
0  24.0  28  30.0  29.0

In [64]:
dfs.dropna ( axis=1 )

    B
0  28
1  32
2  25
3  31

In [65]:
dfs.dropna ( thresh=2 )

      A   B     C     D
0  24.0  28  30.0  29.0
1  31.0  32  23.0   NaN
2  27.0  25   NaN  22.0
3   NaN  31  26.0   NaN

In [66]:
dfs.fillna ( value="NONE" )

      A   B     C     D
0  24.0  28  30.0  29.0
1  31.0  32  23.0  NONE
2  27.0  25  NONE  22.0
3  NONE  31  26.0  NONE

In [67]:
dfs["A"].fillna ( value = dfs["A"].mean() )

0    24.000000
1    31.000000
2    27.000000
3    27.333333
Name: A, dtype: float64

In [68]:
dfs

      A   B     C     D
0  24.0  28  30.0  29.0
1  31.0  32  23.0   NaN
2  27.0  25   NaN  22.0
3   NaN  31  26.0   NaN

In [69]:
com_data = { 
"COMPANY" : [ "GO" , "GO" , "MI" , "MI" , "FA" , "FA" ] ,
"PERSON" : [ "AA" , "BB" , "CC" , "DD" , "EE" , "FF" ] ,
"SALES" : [ 200 , 120 , 340 , 124 , 243 , 350 ] }
com_data

{'COMPANY': ['GO', 'GO', 'MI', 'MI', 'FA', 'FA'],
 'PERSON': ['AA', 'BB', 'CC', 'DD', 'EE', 'FF'],
 'SALES': [200, 120, 340, 124, 243, 350]}

In [70]:
comdf = pd.DataFrame ( com_data )
comdf

  COMPANY PERSON  SALES
0      GO     AA    200
1      GO     BB    120
2      MI     CC    340
3      MI     DD    124
4      FA     EE    243
5      FA     FF    350

In [71]:
comdf.groupby("COMPANY")

In [72]:
comdf.groupby("COMPANY").mean()

C:\Users\ARPIT-MIMANI\AppData\Local\Temp\ipykernel_15324\4192882840.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  comdf.groupby("COMPANY").mean()

         SALES
COMPANY
FA       296.5
GO       160.0
MI       232.0

In [73]:
comdf.groupby("COMPANY").sum()

C:\Users\ARPIT-MIMANI\AppData\Local\Temp\ipykernel_15324\2541725060.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  comdf.groupby("COMPANY").sum()

         SALES
COMPANY
FA         593
GO         320
MI         464

In [74]:
comdf.groupby("COMPANY").std()

C:\Users\ARPIT-MIMANI\AppData\Local\Temp\ipykernel_15324\3286678839.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  comdf.groupby("COMPANY").std()

              SALES
COMPANY
FA        75.660426
GO        56.568542
MI       152.735065

In [75]:
comdf.groupby("COMPANY").sum().loc["FA"]

C:\Users\ARPIT-MIMANI\AppData\Local\Temp\ipykernel_15324\4197868283.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  comdf.groupby("COMPANY").sum().loc["FA"]

SALES    593
Name: FA, dtype: int64

In [76]:
comdf.groupby("COMPANY").count()

         PERSON  SALES
COMPANY
FA            2      2
GO            2      2
MI            2      2

In [77]:
comdf.groupby("COMPANY").max()

        PERSON  SALES
COMPANY
FA          FF    350
GO          BB    200
MI          DD    340

In [78]:
comdf.groupby("COMPANY").min()

        PERSON  SALES
COMPANY
FA          EE    243
GO          AA    120
MI          CC    124

In [79]:
comdf.groupby("COMPANY").describe()

        SALES
        count   mean         std    min     25%    50%     75%    max
COMPANY
FA        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GO        2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MI        2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [80]:
comdf.groupby("COMPANY").describe().transpose()

COMPANY              FA          GO          MI
SALES count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [81]:
comdf.groupby("COMPANY").describe().transpose()["FA"]

SALES  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FA, dtype: float64

In [82]:
df1 = pd.DataFrame ( { 
    "A" : [ "A00" , "A01" , "A02" , "A03" ] , 
    "B" : [ "B00" , "B01" , "B02" , "B03" ] , 
    "C" : [ "C00" , "C01" , "C02" , "C03" ] , 
    "D" : [ "D00" , "D01" , "D02" , "D03" ] } ,
    index = [0,1,2,3] )
df1

     A    B    C    D
0  A00  B00  C00  D00
1  A01  B01  C01  D01
2  A02  B02  C02  D02
3  A03  B03  C03  D03

In [83]:
df2 = pd.DataFrame ( { 
    "A" : [ "A04" , "A05" , "A06" , "A07" ] , 
    "B" : [ "B04" , "B05" , "B06" , "B07" ] , 
    "C" : [ "C04" , "C05" , "C06" , "C07" ] , 
    "D" : [ "D04" , "D05" , "D06" , "D07" ] } ,
    index = [4,5,6,7] )
df2

     A    B    C    D
4  A04  B04  C04  D04
5  A05  B05  C05  D05
6  A06  B06  C06  D06
7  A07  B07  C07  D07

In [84]:
df3 = pd.DataFrame ( { 
    "A" : [ "A08" , "A09" , "A10" , "A11" ] , 
    "B" : [ "B08" , "B09" , "B10" , "B11" ] , 
    "C" : [ "C08" , "C09" , "C10" , "C11" ] , 
    "D" : [ "D08" , "D09" , "D10" , "D11" ] } ,
    index = [8,9,10,11] )
df3

      A    B    C    D
8   A08  B08  C08  D08
9   A09  B09  C09  D09
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [85]:
pd.concat ([ df1 , df2 , df3 ])

      A    B    C    D
0   A00  B00  C00  D00
1   A01  B01  C01  D01
2   A02  B02  C02  D02
3   A03  B03  C03  D03
4   A04  B04  C04  D04
5   A05  B05  C05  D05
6   A06  B06  C06  D06
7   A07  B07  C07  D07
8   A08  B08  C08  D08
9   A09  B09  C09  D09
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [86]:
pd.concat ([ df1 , df2 , df3 ] , axis=1 )

      A    B    C    D    A    B    C    D    A    B    C    D
0   A00  B00  C00  D00  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1   A01  B01  C01  D01  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2   A02  B02  C02  D02  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3   A03  B03  C03  D03  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN  A04  B04  C04  D04  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN  A05  B05  C05  D05  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN  A06  B06  C06  D06  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN  A07  B07  C07  D07  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A08  B08  C08  D08
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A09  B09  C09  D09
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [87]:
left = pd.DataFrame ( { 
    "KEY" : [ "K0" , "K1" , "K2" , "K3" ] ,
    "A" : [ "A00" , "A01" , "A02" , "A03" ] ,
    "B" : [ "B00" , "B01" , "B02" , "B03" ] } )
left

  KEY    A    B
0  K0  A00  B00
1  K1  A01  B01
2  K2  A02  B02
3  K3  A03  B03

In [88]:
right = pd.DataFrame ( { 
    "KEY" : [ "K0" , "K1" , "K2" , "K3" ] ,
    "C" : [ "C00" , "C01" , "C02" , "C03" ] , 
    "D" : [ "D00" , "D01" , "D02" , "D03" ] } )
right

  KEY    C    D
0  K0  C00  D00
1  K1  C01  D01
2  K2  C02  D02
3  K3  C03  D03

In [89]:
pd.merge ( left , right , how="inner" , on="KEY" )

  KEY    A    B    C    D
0  K0  A00  B00  C00  D00
1  K1  A01  B01  C01  D01
2  K2  A02  B02  C02  D02
3  K3  A03  B03  C03  D03

In [90]:
left_table = pd.DataFrame ( { 
    "KEY1" : [ "K0" , "K0" , "K1" , "K2" ] ,
    "KEY2" : [ "K0" , "K1" , "K0" , "K1" ] ,
    "A" : [ "A00" , "A01" , "A02" , "A03" ] ,
    "B" : [ "B00" , "B01" , "B01" , "B01" ] } )
left_table

  KEY1 KEY2    A    B
0   K0   K0  A00  B00
1   K0   K1  A01  B01
2   K1   K0  A02  B01
3   K2   K1  A03  B01

In [91]:
right_table = pd.DataFrame ( { 
    "KEY1" : [ "K0" , "K1" , "K1" , "K2" ] ,
    "KEY2" : [ "K0" , "K0" , "K0" , "K0" ] ,
    "C" : [ "C00" , "C01" , "C02" , "C03" ] , 
    "D" : [ "D00" , "D01" , "D02" , "D03" ] } )
right_table

  KEY1 KEY2    C    D
0   K0   K0  C00  D00
1   K1   K0  C01  D01
2   K1   K0  C02  D02
3   K2   K0  C03  D03

In [92]:
pd.merge ( left_table , right_table , on = [ "KEY1"  ,"KEY2" ] )

  KEY1 KEY2    A    B    C    D
0   K0   K0  A00  B00  C00  D00
1   K1   K0  A02  B01  C01  D01
2   K1   K0  A02  B01  C02  D02

In [93]:
pd.merge ( left_table , right_table , how = "outer" ,  on = [ "KEY1"  ,"KEY2" ] )

  KEY1 KEY2    A    B    C    D
0   K0   K0  A00  B00  C00  D00
1   K0   K1  A01  B01  NaN  NaN
2   K1   K0  A02  B01  C01  D01
3   K1   K0  A02  B01  C02  D02
4   K2   K1  A03  B01  NaN  NaN
5   K2   K0  NaN  NaN  C03  D03

In [94]:
pd.merge ( left_table , right_table , how = "right" ,  on = [ "KEY1"  ,"KEY2" ] )

  KEY1 KEY2    A    B    C    D
0   K0   K0  A00  B00  C00  D00
1   K1   K0  A02  B01  C01  D01
2   K1   K0  A02  B01  C02  D02
3   K2   K0  NaN  NaN  C03  D03

In [95]:
pd.merge ( left_table , right_table , how = "left" ,  on = [ "KEY1"  ,"KEY2" ] )

  KEY1 KEY2    A    B    C    D
0   K0   K0  A00  B00  C00  D00
1   K0   K1  A01  B01  NaN  NaN
2   K1   K0  A02  B01  C01  D01
3   K1   K0  A02  B01  C02  D02
4   K2   K1  A03  B01  NaN  NaN

In [96]:
left_db = pd.DataFrame ( { 
    "A" : [ "A00" , "A01" , "A02" ] , 
    "B" : [ "B00" , "B01" , "B02" ] } ,
    index = [ "K0" , "K1" , "K2" ] )
left_db

      A    B
K0  A00  B00
K1  A01  B01
K2  A02  B02

In [97]:
right_db = pd.DataFrame ( { 
    "C" : [ "C00" , "C02" , "C03" ] , 
    "D" : [ "D00" , "D02" , "D03" ] } ,
    index = [ "K0" , "K2" , "K3" ] )
right_db

      C    D
K0  C00  D00
K2  C02  D02
K3  C03  D03

In [98]:
left_db.join ( right_db )

      A    B    C    D
K0  A00  B00  C00  D00
K1  A01  B01  NaN  NaN
K2  A02  B02  C02  D02

In [99]:
left_db.join ( right_db , how="outer" )

      A    B    C    D
K0  A00  B00  C00  D00
K1  A01  B01  NaN  NaN
K2  A02  B02  C02  D02
K3  NaN  NaN  C03  D03

In [100]:
left_db.join ( right_db , how="inner" )

      A    B    C    D
K0  A00  B00  C00  D00
K2  A02  B02  C02  D02

In [101]:
col_df = pd.DataFrame ( { 
    "COL1" : [1,2,3,4] ,
    "COL2" : [444,555,666,444] ,
    "COL3" : ["AAA","BBB","CCC","DDD"] } )
col_df

   COL1  COL2 COL3
0     1   444  AAA
1     2   555  BBB
2     3   666  CCC
3     4   444  DDD

In [102]:
col_df.head()

   COL1  COL2 COL3
0     1   444  AAA
1     2   555  BBB
2     3   666  CCC
3     4   444  DDD

In [103]:
col_df["COL2"].unique()

array([444, 555, 666], dtype=int64)

In [104]:
col_df["COL2"].nunique()

3

In [105]:
len ( col_df["COL2"].unique() )

3

In [106]:
col_df["COL2"].value_counts()

444    2
555    1
666    1
Name: COL2, dtype: int64

In [107]:
def twice (x) :
    return x * 2 

twice(42)

84

In [108]:
col_df["COL1"].sum()

10

In [109]:
col_df["COL1"].apply (twice)

0    2
1    4
2    6
3    8
Name: COL1, dtype: int64

In [110]:
col_df["COL3"].apply (len)

0    3
1    3
2    3
3    3
Name: COL3, dtype: int64

In [111]:
col_df["COL2"].apply ( lambda x : x * 2 )

0     888
1    1110
2    1332
3     888
Name: COL2, dtype: int64

In [112]:
col_df

   COL1  COL2 COL3
0     1   444  AAA
1     2   555  BBB
2     3   666  CCC
3     4   444  DDD

In [113]:
col_df.columns

Index(['COL1', 'COL2', 'COL3'], dtype='object')

In [114]:
col_df.index

RangeIndex(start=0, stop=4, step=1)

In [115]:
col_df.sort_values ("COL2")

   COL1  COL2 COL3
0     1   444  AAA
3     4   444  DDD
1     2   555  BBB
2     3   666  CCC

In [116]:
col_df.sort_values ( by="COL2" )

   COL1  COL2 COL3
0     1   444  AAA
3     4   444  DDD
1     2   555  BBB
2     3   666  CCC

In [117]:
col_df.isnull()

    COL1   COL2   COL3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [118]:
pivot_df = { "A" : [ "TOM" , "TOM" , "TOM" , "JOE" , "JOE" , "JOE" ] ,
          "B" : [ "ONE" , "ONE" , "TWO" , "TWO" , "ONE" , "ONE" ] ,
          "C" : [ "X" , "Y" , "X" , "Y" , "X" , "Y" ] ,
          "D" : [1,3,2,5,4,1] }
pt_df = pd.DataFrame( data = pivot_df )
pt_df

     A    B  C  D
0  TOM  ONE  X  1
1  TOM  ONE  Y  3
2  TOM  TWO  X  2
3  JOE  TWO  Y  5
4  JOE  ONE  X  4
5  JOE  ONE  Y  1

In [119]:
pt_df.pivot_table ( values="D" , index=["A","B"] , columns=["C"] )

C          X    Y
A   B
JOE ONE  4.0  1.0
    TWO  NaN  5.0
TOM ONE  1.0  3.0
    TWO  2.0  NaN

In [120]:
pwd

'C:\\Users\\ARPIT-MIMANI\\PYTHON FOR DATA SCIENCE AND MACHINE LEARNING BOOTCAMP - JOSE PORTILLA'

In [121]:
excel_df = pd.read_excel ( "EXAMPLE_DATA.xlsx" )
excel_df

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [122]:
excel_df.to_csv ( "MY_OUTPUT" )
pd.read_csv ( "MY_OUTPUT" )

   Unnamed: 0   A   B   C   D
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [123]:
excel_df.to_csv ( "MY_OUTPUT"  , index=False )
pd.read_csv ( "MY_OUTPUT" )

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [124]:
excel_df = pd.read_excel ( "EXAMPLE_DATA.xlsx" , sheet_name="example" )
excel_df

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [125]:
excel_df.to_excel ( "EXCEL_EXAMPLE.xlsx" , sheet_name="newsheet" )
pd.read_excel ( "EXCEL_EXAMPLE.xlsx"  )

   Unnamed: 0   A   B   C   D
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [126]:
html_df = pd.read_html ( "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list" )
html_df

[                         Bank NameBank       CityCity StateSt  CertCert  \
 0                        Citizens Bank       Sac City      IA      8758
 1             Heartland Tri-State Bank        Elkhart      KS     25851
 2                  First Republic Bank  San Francisco      CA     59017
 3                       Signature Bank       New York      NY     57053
 4                  Silicon Valley Bank    Santa Clara      CA     24735
 ..                                 ...            ...     ...       ...
 563                 Superior Bank, FSB       Hinsdale      IL     32646
 564                Malta National Bank          Malta      OH      6629
 565    First Alliance Bank & Trust Co.     Manchester      NH     34264
 566  National State Bank of Metropolis     Metropolis      IL      3815
 567                   Bank of Honolulu       Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0              Iowa Trust & Savings Bank    November 3, 2023     10545
 1                 Dream First Bank, N.A.       July 28, 2023     10544
 2              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
 3                    Flagstar Bank, N.A.      March 12, 2023     10540
 4    FirstCitizens Bank & Trust Company      March 10, 2023     10539
 ..                                   ...                 ...       ...
 563                Superior Federal, FSB       July 27, 2001      6004
 564                    North Valley Bank         May 3, 2001      4648
 565  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 566              Banterra Bank of Marion   December 14, 2000      4646
 567                   Bank of the Orient    October 13, 2000      4645

 [568 rows x 7 columns]]

In [127]:
type(html_df)

list

In [128]:
html_df[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
1,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
2,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
3,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
4,Silicon Valley Bank,Santa Clara,CA,24735,FirstCitizens Bank & Trust Company,"March 10, 2023",10539
...,...,...,...,...,...,...,...
563,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
564,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
565,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
566,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
567,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [129]:
html_df[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
1,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
2,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
3,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
4,Silicon Valley Bank,Santa Clara,CA,24735,FirstCitizens Bank & Trust Company,"March 10, 2023",10539

In [130]:
""" 
from sqlalchemy import create_engine
sql_engine = create_engine ( "sqlite:///:memory" )
excel_df.to_sql ( "MY_TABLE" , sql_engine )
sql_df = pd.read_sql ( "MY_TABLE" , con=sql_engine ) 
sql_df 
"""

' \nfrom sqlalchemy import create_engine\nsql_engine = create_engine ( "sqlite:///:memory" )\nexcel_df.to_sql ( "MY_TABLE" , sql_engine )\nsql_df = pd.read_sql ( "MY_TABLE" , con=sql_engine ) \nsql_df \n'